app/views/users/_users.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 4]]
---
					<%= user.username %> ·
					<%= pluralize(user.posts.count, "post") %>