app/views/posts/_posts.html.erb

INSERT INTO "posts" ("text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "asdasdasd"], ["user_id", 4], ["created_at", "2015-09-11 19:44:56.456937"], ["updated_at", "2015-09-11 19:44:56.456937"]]
---
				<%= link_to post.username, user_path(post.user) %> ·
				<%= time_ago_in_words(post.created_at) %>