app/controllers/pages_controller.rb

  def home
  	@recent_posts = Post.last(3).reverse
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" DESC LIMIT 3