app/controllers/posts_controller.rb

INSERT INTO "posts" ("text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "ASdASDASdAsd"], ["user_id", 3], ["created_at", "2015-09-11 14:21:10.451721"], ["updated_at", "2015-09-11 14:21:10.451721"]]
---
  def create
  	@post = current_user.posts.create(params[:post].permit(:text))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 20]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 20]]
---
  def destroy
  	@post = Post.find(params[:id])
  	@post.destroy if @post.user == current_user