app/controllers/users_controller.rb

  def show
  	@user = User.find_by(username: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "bradpitt"]]

  def follow
    if user_signed_in?
      @user = User.find_by(username: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "example37"]]

  def unfollow
    @user = User.find_by(username: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "example39"]]

  def notifications
    @user = current_user
    @notifications = @user.notifications
    @notifications.each do |notification|
      notification.update_attribute :read, true
---
UPDATE "notifications" SET "read" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["read", "t"], ["updated_at", "2015-09-11 20:47:41.716408"], ["id", 1]]

  def search
    @users = User.where("username LIKE ?", "%#{params[:search][:text]}%")
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "augusto3"]]